Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ДнейОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/AccumulationRegisters/ВКМ_ДнейОтпуска/ВКМ_ДнейОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ДнейОтпуска</name>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>DefinedType.ВКМ_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ВКМ_ДнейОтпуска Приход
	Движения.ВКМ_ДнейОтпуска.Записывать = Истина;  
	Движения.ВКМ_ДнейОтпуска.Записать();  
	
	ТабЧасть = ОтпускаСотрудников.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Сотрудник КАК Сотрудник,
		|	Таблица.ДатаНачала КАК ДатаНачала,
		|	Таблица.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВТ_Данные.ДатаНачала, ВТ_Данные.ДатаОкончания, ДЕНЬ)) КАК ДнейОтпуска,
		|	ВТ_Данные.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Данные.Сотрудник,
		|	ВТ_Данные.ДатаНачала";    
	
	Запрос.УстановитьПараметр("Таблица", ТабЧасть);    	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ДнейОтпуска.ДобавитьПриход();
		Движение.Регистратор = Ссылка;
		Движение.Период = Выборка.ДатаНачала;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ДнейОтпуска = Выборка.ДнейОтпуска;    
		
	КонецЦикла;
	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПриИзмененииДанных() Экспорт
	
	МассивСотрудников = ПолучитьСотрудниковПревышениеОтпуска(ОтпускаСотрудников);
	
	Возврат МассивСотрудников;     
	
КонецФункции    

Функция ПолучитьСотрудниковПревышениеОтпуска (Объект)
	
	ТабЧасть = Объект.Выгрузить();	
	
	ТабЧасть.Колонки.Добавить("ДниОтпуска");   
	
	Для Каждого Строка Из ТабЧасть Цикл
		
		Строка.ДниОтпуска = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала))/86400;
		
	КонецЦикла;
	
	ТабЧасть.Свернуть("Сотрудник", "ДниОтпуска");
	
	Массив = Новый Массив;
	
	Для Каждого Строка Из ТабЧасть Цикл  
		
		Если Строка.ДниОтпуска > 28 Тогда
			
			Сотрудники = Новый Структура;
			Сотрудники.Вставить("Сотрудник", Строка.Сотрудник);
			Сотрудники.Вставить("Дней", Строка.ДниОтпуска);
			
			Массив.Добавить(Сотрудники);  
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#КонецЕсли
